#Использовать ".."

// вывод комбинированной цветной строки, Синий - цвет по умолчанию
ЦветнойВывод.ВывестиСтроку(
		"(Оу!|#color=White) Привет, (Красный!|#color=Красный) Кажется я выгляжу '(малиновым|#color=Малиновый)'.
		|Ты тоже видишь (желтый текст|#color=Желтый) ???", "Синий");

// вывод пустой строки
ЦветнойВывод.ВывестиСтроку();

// вывод строки с игнорированием цветовых маркеров. "Монохром" - спецслово.
ЦветнойВывод.ВывестиСтроку("Произвольная (монохромная|#color=Yellow) (строка|#color=Красный)", "Монохром");

// не задан цвет по умолчанию - используется цвет текста консоли, если удалось его прочесть 
ЦветнойВывод.ВывестиСтроку("Произвольная (желтая|#color=Yellow) (строка|#color=Синий) с цветом по умолчанию");


// вывод незавершенной (без перевода) строки
ЦветнойВывод.Вывести("Процесс выполнения... ", "Серый");
// вывод завершения строки
ЦветнойВывод.ВывестиСтроку("Done", "Зеленый");
